{
    "books": [
        {
          "isbn": "9783960090427",
          "title": "Durchstarten mit React",
          "authors": [
            ""
          ],
          "published": "2019-02-21T13:10:20.138Z",
          "subtitle": "Web-Apps einfach und modular entwickeln",
          "rating": 3,
          "thumbnails": [
            {
              "url": "https://www.oreilly.de/common/images/cover_masterid/300/12871.jpg",
              "title": "Titelbild"
            }
          ],
          "description": "Eignen Sie sich ohne Ballast alles Wesentliche zur Frontendentwicklung mit React an - einer JavaScript-Bibliothek, die in Entwicklerkreisen derzeit auf großes Interesse stößt. In diesem praktischen Leitfaden erläutert Stoyan Stefanov, Webentwickler bei Facebook, Reacts Komponentenarchitektur und zeigt, wie Sie in kurzer Zeit komplexe und dennoch wartbare Webanwendungen entwickeln. Sie benötigen keine besonderen Vorkenntnisse - lediglich Grundkenntnis der JavaScript-Syntax - und können sofort loslegen."
        },
        {
          "isbn": "9783864903571",
          "title": "Angular",
          "authors": [
            "Gregor Woiwode",
            "Ferdinand Malcher",
            "Danny Koppenhagen",
            "Johannes Hoppe"
          ],
          "published": "2017-04-01T12:00:00.000Z",
          "subtitle": "Grundlagen, fortgeschrittene Techniken und Best Practices mit TypeScript - ab Angular 4, inklusive NativeScript und Redux",
          "rating": 5,
          "thumbnails": [
            {
              "url": "https://ng-buch.de/cover2.jpg",
              "title": "Front Cover"
            }
          ],
          "description": "Mit Angular setzen Sie auf ein modernes und modulares Web-Framework. Dieses Buch stellt Ihnen die Bausteine von Angular, viele Best Practices und die notwendigen Werkzeuge vor. Beginnen Sie Ihren Einstieg in die Welt von Angular mit einer praxisnahen Einführung.\n        Jedes Thema wird zunächst theoretisch behandelt und anschließend anhand einer durchgehenden Beispielanwendung (https://ng-buch.de/app) demonstriert.\n        Meistern Sie die komponentenorientierte Webentwicklung und lernen Sie zusätzlich einen Weg zur Erstellung mobiler Apps (NativeScript) kennen. Mit der Redux-Architektur beherrschen Sie auch komplexe Anwendungen.\n        Sie werden als Einsteiger und auch als fortgeschrittener Webentwickler Freude bei der Lektüre dieses Buchs haben.)"
        },
        {
          "isbn": "3864901545",
          "title": "AngularJS",
          "authors": [
            "Philipp Tarasiewicz",
            "Robin Böhm"
          ],
          "published": "2014-05-01T00:00:00.000Z",
          "subtitle": "Eine praktische Einführung",
          "rating": 4,
          "thumbnails": [
            {
              "url": "https://ng-buch.de/cover1.jpg",
              "title": "Front Cover"
            }
          ],
          "description": "Dieses Buch führt Sie anhand eines zusammenhängenden Beispielprojekts schrittweise an die Entwicklung mit dem clientseitigen Webframework AngularJS heran. Lernen Sie dabei Konzepte und Techniken kennen, mit denen Sie strukturierte, modularisierte und gut wartbare JavaScript-Webapplikationen erstellen können."
        }
      ]
  }